# 2.2 Pandas - DataFrames

In [1]:
import pandas as pd
import numpy as np

#### 1. Crie e exiba um DataFrame, que chamaremos de DataFrame1 daqui para a frente: <br>
dataframe1 = {'nome': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'pontuação': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],<br>
'tentativas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],<br>
'qualificar': ['sim', 'não', 'sim', 'não', 'não', 'sim', 'sim', 'não', 'não', 'sim']}<br>
rótulos = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']<br>

In [2]:
dataframe1 = {'nome': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'pontuação': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'tentativas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualificar': ['sim', 'não', 'sim', 'não', 'não', 'sim', 'sim', 'não', 'não', 'sim']}
rotulos = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(dataframe1,index = rotulos)
df

        nome  pontuação  tentativas qualificar
a  Anastasia       12.5           1        sim
b       Dima        9.0           3        não
c  Katherine       16.5           2        sim
d      James        NaN           3        não
e      Emily        9.0           2        não
f    Michael       20.0           3        sim
g    Matthew       14.5           1        sim
h      Laura        NaN           1        não
i      Kevin        8.0           2        não
j      Jonas       19.0           1        sim

#### 2. Exiba um resumo das informações básicas sobre o DataFrame1 e os seus dados.

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nome        10 non-null     object
 1   pontuação   8 non-null      float64
 2   tentativas  10 non-null     int64
 3   qualificar  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

#### 3. Obtenha as 3 primeiras linhas do DataFrame1.

In [4]:
df.iloc[:3]

        nome  pontuação  tentativas qualificar
a  Anastasia       12.5           1        sim
b       Dima        9.0           3        não
c  Katherine       16.5           2        sim

#### 4. Selecione as colunas 'nome' e 'pontuação' do DataFrame1.

In [5]:
df[['nome','pontuação']]

        nome  pontuação
a  Anastasia       12.5
b       Dima        9.0
c  Katherine       16.5
d      James        NaN
e      Emily        9.0
f    Michael       20.0
g    Matthew       14.5
h      Laura        NaN
i      Kevin        8.0
j      Jonas       19.0

#### 5. Selecione as colunas e linhas especificadas de um determinado quadro de dados. <br>
Selecione as colunas 'nome' e 'pontuação' nas linhas 1, 3, 5, 6 do quadro do DataFrame1.<br>

In [6]:
df.iloc[[1,3,5,6],[0,1]]

      nome  pontuação
b     Dima        9.0
d    James        NaN
f  Michael       20.0
g  Matthew       14.5

#### 6. Selecione as linhas do DataFrame1 onde o número de tentativas no exame é maior que 2.

In [7]:
df[df['tentativas']>2]

      nome  pontuação  tentativas qualificar
b     Dima        9.0           3        não
d    James        NaN           3        não
f  Michael       20.0           3        sim

#### 7. Conte o número de linhas e colunas do DataFrame1.

In [9]:
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Número de linhas: " + str(total_rows))
print("Número de colunas: " + str(total_cols))

Número de linhas: 10
Número de colunas: 4

#### 8. Selecione as linhas onde a pontuação está em falta do DataFrame1.

#### 9. Selecione as linhas em que a pontuação está entre 15 e 20 (inclusive) do DataFrame1.

In [10]:
df[df['pontuação'].between(15,20)]

        nome  pontuação  tentativas qualificar
c  Katherine       16.5           2        sim
f    Michael       20.0           3        sim
j      Jonas       19.0           1        sim

#### 10. Selecione as linhas onde o número de tentativas no exame é menor que 2 e a pontuação maior que 15 do DataFrame1.

#### 11. Altere a pontuação do DataFrame1 na linha 'd' para 11,5.

#### 12. Calcule a soma das tentativas de exame dos alunos.

#### 13. Calcule a pontuação média para cada aluno diferente no DataFrame1.

#### 14. Anexe uma nova linha 'k' ao quadro de dados com os valores fornecidos para cada coluna. Agora exclua a nova linha e retorne o DataFrame original. <br>
Os valores para cada coluna serão:<br>
nome: "Suresh", pontuação: 15,5, tentativas: 1, qualificação: "sim", etiqueta: "k"<br>

#### 15. Ordene o DataFrame primeiro por 'nome' em ordem decrescente, depois por 'pontuação' em ordem crescente. <br>

#### 16. Substitua a coluna 'qualificar' que contém os valores 'sim' e 'não' por True e False. <br>

#### 17. Altere o nome 'James' para 'Suresh' na coluna de nome do DataFrame1. <br>

In [11]:
df['nome'] = df['nome'].replace('James', 'Suresh')
df

        nome  pontuação  tentativas qualificar
a  Anastasia       12.5           1        sim
b       Dima        9.0           3        não
c  Katherine       16.5           2        sim
d     Suresh        NaN           3        não
e      Emily        9.0           2        não
f    Michael       20.0           3        sim
g    Matthew       14.5           1        sim
h      Laura        NaN           1        não
i      Kevin        8.0           2        não
j      Jonas       19.0           1        sim

#### 18. Exclua a coluna 'tentativas' do DataFrame1. <br>

#### 19. Insira uma nova coluna no DataFrame1 existente. <br>

cor = ['Vermelho','Azul','Laranja','Vermelho','Branco','Branco','Azul','Verde','Verde','Vermelho']

#### 20. Obtenha a lista dos cabeçalhos das colunas do DataFrame1. <br>

#### 21. Substitua todos os valores NaN por zeros  no dataframe1.

#### 22. Redefina o índice do DataFrame1

In [12]:
df = df.reset_index()
df

  index       nome  pontuação  tentativas qualificar
0     a  Anastasia       12.5           1        sim
1     b       Dima        9.0           3        não
2     c  Katherine       16.5           2        sim
3     d     Suresh        NaN           3        não
4     e      Emily        9.0           2        não
5     f    Michael       20.0           3        sim
6     g    Matthew       14.5           1        sim
7     h      Laura        NaN           1        não
8     i      Kevin        8.0           2        não
9     j      Jonas       19.0           1        sim

#### 23.  Obtenha os tipos de dados das colunas do DataFrame1

In [13]:
df.dtypes

index          object
nome           object
pontuação     float64
tentativas      int64
qualificar     object
dtype: object

#### 24.  Converta o tipo de dados da coluna pontuação (floats para ints).

In [14]:
df.pontuação = df.pontuação.astype(int)
print(df)
print(df.dtypes)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer